IDENTIFICATION  DIVISION.
PROGRAM-ID.     CLIOPTIONS.

ENVIRONMENT     DIVISION.

DATA            DIVISION.
WORKING-STORAGE SECTION.
01 argv  PICTURE X(100) value spaces.
01 METRE PICTURE 9(6).
01 MEMO  PICTURE 9(2).

PROCEDURE DIVISION.
MAIN.
  ACCEPT argv FROM argument-value;
  SET METRE TO argv;
  IF  METRE < 100  THEN
    DISPLAY "00";
  ELSE IF  METRE <= 5000  THEN
    COMPUTE MEMO = METRE * 0.01;
    DISPLAY MEMO;
  ELSE IF  6000 <= METRE AND METRE <= 30000  THEN
    COMPUTE MEMO = METRE * 0.001;
    COMPUTE MEMO = MEMO  + 50;
    DISPLAY MEMO;
  ELSE IF 35000 <= METRE AND METRE <= 70000  THEN
    COMPUTE MEMO = METRE * 0.001;
    COMPUTE MEMO = MEMO  - 30;
    COMPUTE MEMO = MEMO  * 0.2;
    COMPUTE MEMO = MEMO  + 80;
    DISPLAY MEMO;
  ELSE IF 70000 < METRE  THEN
    DISPLAY "89";
  END-IF
  END-IF
  END-IF
  END-IF
  END-IF.
  STOP RUN.
